---
kind: other
id: Methods.T:Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings
source: html/dc4f7001-08f8-3a6d-7f40-6b0cc7ded5a0.htm
---
# AnalysisDisplayLegendSettings Methods

Compares two legend settings objects.